# GetLights Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightGroup..::..GetLights Method
LightGroup Class See Also
---
Get the set of contained light instances The set of light instances
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ICollection<ElementId> GetLights()
```

Visual Basic
---
```text
Public Function GetLights As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetLights()
```

# See Also
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace